{
  "scales": [
    {
      "name": "PSII Scale",
      "description": "Used by the Pacific School of Innovation and Inquiry.",
      "levels": [
        {
          "name": "developing",
          "description": "Description for Developing level."
        },
        {
          "name": "expanding",
          "description": "Description for Expanding level."
        },
        {
          "name": "fluent",
          "description": "Description for Fluent level."
        },
        {
          "name": "proficient",
          "description": "Description for Proficient level."
        }
      ]
    },
    {
      "name": "Provincial Proficiency Scale",
      "description": "Used by the British Columbia Ministry of Education.",
      "levels": [
        {
          "name": "emerging",
          "description": "\"Emerging\" indicates that a student is just beginning to demonstrate learning in relation to the learning standards but is not yet doing so consistently. Emerging isn’t failing. Students who are not yet demonstrating any learning in relation to the learning standards can be assessed as Emerging. If this is due to insufficient evidence of learning, the student can be assigned an IE."
        },
        {
          "name": "developing",
          "description": "\"Developing\" indicates that a student is demonstrating learning in relation to the learning standards with growing consistency. The student is showing initial understanding but is still in the process of developing their competency in relation to the learning standards. Developing isn’t failing. All students will be developing in some areas and at specific points in time."
        },
        {
          "name": "proficient",
          "description": "\"Proficient\" is the goal for all students. A student is Proficient when they demonstrate the expected learning in relation to the learning standards. Proficient is not synonymous with perfection. Instead, the student is able to demonstrate their learning consistently or most of the time."
        },
        {
          "name": "extending",
          "description": "\"Extending\" is not synonymous with perfection. A student is Extending when they demonstrate learning, in relation to learning standards, with increasing depth and complexity. Extending is not a bonus or a reward and does not necessarily require that students do a greater volume of work or work at a higher grade level. Extending is not the goal for all students; Proficient is. Therefore, if a student turns in all their work and demonstrates evidence of learning in all learning standards for an area of learning, they are not automatically assigned Extending."
        }
      ]
    },
    {
      "name": "Levels of Achievement",
      "description": "Used by the Ontario Ministry of Education.",
      "levels": [
        {
          "name": "level 1",
          "description": "Level 1 represents achievement that falls much below the provincial standard. The student demonstrates the specified knowledge and skills with limited effectiveness. Students must work at significantly improving in specific areas, as necessary, if they are to be successful in a subject or course in the next grade."
        },
        {
          "name": "level 2",
          "description": "Level 2 represents achievement that approaches the standard. The student demonstrates the specified knowledge and skills with some effectiveness. Students performing at this level need to work on identified learning gaps to ensure future success."
        },
        {
          "name": "level 3",
          "description": "Level 3 represents the provincial standard for achievement. The student demonstrates the specified knowledge and skills with considerable effectiveness. Parents of students achieving at level 3 can be confident that their children will be prepared for work in subsequent grades or courses."
        },
        {
          "name": "level 4",
          "description": "Level 4 identifies achievement that surpasses the provincial standard. The student demonstrates the specified knowledge and skills with a high degree of effectiveness. However, achievement at level 4 does not mean that the student has achieved expectations beyond those specified for the grade or course."
        }
      ]
    }
  ]
}
